Tasks/ЗаписьДневника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Task>
		<Properties>
			<Name>ЗаписьДневника</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РасписаниеНаДень</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУрока</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Мероприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Task>
</MetaDataObject>

Documents/Мероприятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Мероприятие</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Tasks/ЗаписьДневника/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура Расчет(Команда)     
	Для каждого Урок Из Объект.РасписаниеНаДень Цикл
		Если Урок.Мероприятие.Пустая() И ЗначениеЗаполнено(Урок.ВидУрока) Тогда
			Урок.Мероприятие = СоздатьМероприятие(Урок.НомерСтроки - 1)		
		КонецЕсли;                                                     	
	КонецЦикла;                                                        
КонецПроцедуры                                                         

Функция СоздатьМероприятие(ИндексСтроки)
	ТС = Объект.РасписаниеНаДень[ИндексСтроки];
	НовоеМероприятие = Документы.Мероприятие.СоздатьДокумент();
	КодУрока = Число(ТС.НомерСтроки);
	Урок = Справочники.ВремяУроков.НайтиПоКоду(КодУрока);
	НовоеМероприятие.Номер = "У-" + ТС.НомерСтроки;
	НовоеМероприятие.Дата = НачалоДня(Объект.Дата) + (Урок.ВремяНачала - '00010101');
	НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.Урок;
	НовоеМероприятие.ВидМероприятия = ТС.ВидУрока;
	НовоеМероприятие.Записать();
	Возврат НовоеМероприятие.Ссылка
КонецФункции // СоздатьМероприятие()      


&НаКлиенте
Процедура РасписаниеНаДеньВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "РасписаниеНаДеньМероприятие" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Мероприятие) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Мероприятие);		
		КонецЕсли;                                             	
	КонецЕсли;                                                 
КонецПроцедуры
